public_html/Django/django2-db.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Django数据操作</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Django数据操作"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-14 20:00"/>
<meta name="author" content="wchunx "/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="../css/org.css" rel="stylesheet" type="text/css">
<link href="../css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Django数据操作</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 MVC模式</a></li>
<li><a href="#sec-2">2 数据库配置</a>
<ul>
<li><a href="#sec-2-1">2.1 setting.py中数据库的配置</a></li>
<li><a href="#sec-2-2">2.2 测试</a></li>
</ul>
</li>
<li><a href="#sec-3">3 创建app</a>
<ul>
<li><a href="#sec-3-1">3.1 project与app</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> MVC模式</h2>
<div class="outline-text-2" id="text-1">

<p>Django是一种MVC框架，以下是Django中 M、V和C各自的含义：
</p><ul>
<li>M 数据存取部分，由django数据库层处理，本章要讲述的内容。
</li>
<li>V 选择显示哪些数据要显示以及怎样显示的部分，由视图和模板处理。
</li>
<li>C 根据用户输入委派视图的部分，由Django框架根据URLconf设置，对给定URL调用适当的Python函数。
</li>
</ul>

<p>由于C由框架自行处理，而Django里更关注的是模型（Model）、模板(Template)和视图（Views），Django 也被称为 MTV 框架 。在 MTV 开发模式中：
</p><ul>
<li>M 代表模型（Model），即数据存取层。该层处理与数据相关的所有事务：如何存取、如何验证有效性、包含哪些行为以及数据之间的关系等。
</li>
<li>T 代表模板(Template)，即表现层。该层处理与表现相关的决定：如何在页面或其他类型文档中进行显示。
</li>
<li>V 代表视图（View），即业务逻辑层。该层包含存取模型及调取恰当模板的相关逻辑。你可以把它看作模型与模板之间的桥梁。
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 数据库配置</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> setting.py中数据库的配置</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-python"><span style="color: #268bd2;">DATABASES</span> = {
    <span style="color: #2aa198;">'default'</span>: {
        <span style="color: #2aa198;">'ENGINE'</span>: <span style="color: #2aa198;">'django.db.backends.mysql'</span>, <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#20351;&#29992;&#20309;&#31181;&#25968;&#25454;&#24211;&#65292;&#36825;&#37324;&#29992;mysql</span>
        <span style="color: #2aa198;">'NAME'</span>: <span style="color: #2aa198;">'site'</span>,                       <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#25968;&#25454;&#24211;&#21517;</span>
        <span style="color: #2aa198;">'USER'</span>: <span style="color: #2aa198;">'site'</span>,                       <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#29992;&#25143;&#21517;</span>
        <span style="color: #2aa198;">'PASSWORD'</span>: <span style="color: #2aa198;">'site'</span>,                   <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#23494;&#30721;</span>
        <span style="color: #2aa198;">'HOST'</span>: <span style="color: #2aa198;">'localhost'</span>,                  <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#36830;&#25509;&#20027;&#26426;</span>
        <span style="color: #2aa198;">'PORT'</span>: <span style="color: #2aa198;">''</span>,                           <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#36830;&#25509;&#31471;&#21475;&#65292;&#30041;&#31354;&#23601;&#26159;&#40664;&#35748;&#31471;&#21475;</span>
    }
}
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 测试</h3>
<div class="outline-text-3" id="text-2-2">

<p>创建数据库
</p>


<pre class="src src-sh">create database site;
GRANT ALL PRIVILEGES ON site.* TO <span style="color: #2aa198;">'site'</span>@<span style="color: #2aa198;">'localhost'</span> IDENTIFIED BY <span style="color: #2aa198;">'site'</span>;
GRANT ALL PRIVILEGES ON site.* TO <span style="color: #2aa198;">'site'</span>@<span style="color: #2aa198;">'%'</span> IDENTIFIED BY <span style="color: #2aa198;">'site'</span>;
</pre>

<p>
使用前确保已安装python-mysqldb
</p>


<pre class="src src-python"><span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&#21551;&#21160;&#35299;&#37322;&#22120;</span>
python manage.py shell
&gt;&gt;&gt; <span style="color: #859900;">from</span> django.db <span style="color: #859900;">import</span> connection
&gt;&gt;&gt; <span style="color: #268bd2;">cursor</span> = connection.cursor()
</pre>

<p>
如果没有错误信息表示配置正确。
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 创建app</h2>
<div class="outline-text-2" id="text-3">

<p>Django app： 一个包含模型，视图和Django代码，并且形式为独立Python包的完整Django应用。
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> project与app</h3>
<div class="outline-text-3" id="text-3-1">

<p>它们的区别就是一个是配置，另一个是代码：
</p>
<p>
一个project包含很多个Django app以及对它们的配置。<br/>
技术上，project的作用是提供配置文件，比方说哪里定义数据库连接信息, 安装的app列表，TEMPLATE_DIRS，等等。
一个app是一套Django功能的集合，通常包括模型和视图，按Python的包结构的方式存在。
</p>
<p>
如果只是建造一个简单的Web站点，可能一个app就可以了；但如果是一个包含许多不相关的模块的复杂的网站，例如电子商务和社区之类的站点，那么你可能需要把这些模块划分成不同的app，以便以后复用。
</p>
<p>
也可以不创建app，如前面使用的例子，我们只是简单的创建了一个称为views.py的文件，编写了一些函数并在URLconf中设置了各个函数的映射。这些情况都不需要使用apps。
</p>
<p>
<b>但是，系统对app有一个约定：如果你使用了Django的数据库层（模型），你必须创建一个Django app。模型必须存放在apps中。因此，为了开始建造我们的模型，我们必须创建一个新的app。</b>
</p>
<p>
在项目mysite目录下创建books app。
</p>


<pre class="src src-sh">python manage.py startapp books
</pre>

<p>
books目录
</p>
<pre class="example">
books/
 |- __init__.py
 |- models.py
 |- tests.py
 |- views.py
</pre>


<p>
这个目录包含了这个app的模型和视图。
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
    <p class="postamble">Last Updated 2014-01-14 20:00.</p> 
</div>
</body>
</html>
